package day11.product;

public class HomeworkEx3 {
	
	public static void main(String[] args) {
		/* 사이트에서 회원 관리(로그인, 회원가입 등)를 위한 Member 클래스를 작성하세요.*/

		//작성한 Member 클래스를 이용하여 인스턴스를 생성하고 구현한 메서드를 테스트해보세요.

	}

}

class Member{
	//필요한 멤버변수 및 메서드를 정리하고 구현하세요.
	/* 아이디, 비밀번호, 고객정보(이름, 전화번호, 주소)
	 * 회원가입 하기위해서 메서드
	 * 개인정보 및 아이디 비밀번호 입력해서 저장되는 메서드
	 * 회원가입 하시겠습니까?
	 * boolean으로 ture false 처리해야하나?
	 * yes or no 출력 yes시 회원가입이 완료되었습니다. no입력시 회원가입이 취소되었습니다.
	 * 
	 * 로그인 하기위한 메서드
	 * 아이디 비밀번호를 입력해서 맞다면? 로그인 성공 다르다면 실패
	 * 아이디 입력, 비밀번호 입력 따로해서 아이디가 틀리다면 아이디를 다시 확인하세요 비밀번호 틀리다면 비밀번호를 다시 확인하세요.
	 * 
	 * 
	 */
}